DataProcessors/атл_ОбменДаннымиУМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>атл_ОбменДаннымиУМС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтключитьИнформированиеОСтатусеОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЛогинов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕстьИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьОшибка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛогинНаСервере</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриоритетНаСервере</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор1СНаСервере</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательВ1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛогинВ1С</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриоритетВ1С</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстройствоПодключеноНаСервере</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЛогинаНаСервере</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольВ1С</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяУстройства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсииПродукта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПродукта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполняемоеДействие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.атл_ВидыВыполняемыхСПользователямиДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписыватьТрекПоРасписаниюВ1С</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписыватьКоординатыСобытийПоРасписаниюВ1С</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучатьИнформациюОТекущемМестонахожденииВ1С</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписыватьТрекПоРасписаниюНаСервере</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписыватьКоординатыСобытийПоРасписаниюНаСервере</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучатьИнформациюОТекущемМестонахожденииНаСервере</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НапоминатьОЗадачеВМоментЗапланированогоНачалаРаботВ1С</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМинутЗаКотороеНапоминатьОЗадачеДоЗапланированогоНачалаРаботВ1С</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НапоминатьОНеобходимостиИзмененияСтатусаВМоментПрибытияНаМестоВыполненияРаботВ1С</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НапоминатьОНеобходимостиИзмененияСтатусаВМоментВыходаИзЗоныМестаВыполненияРаботВ1С</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПовторятьНапоминаниеОНовойЗадачеВ1С</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НапоминатьОЗадачеВМоментЗапланированогоНачалаРаботНаСервере</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМинутЗаКотороеНапоминатьОЗадачеДоЗапланированогоНачалаРаботНаСервере</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НапоминатьОНеобходимостиИзмененияСтатусаВМоментПрибытияНаМестоВыполненияРаботНаСервере</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НапоминатьОНеобходимостиИзмененияСтатусаВМоментВыходаИзЗоныМестаВыполненияРаботНаСервере</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПовторятьНапоминаниеОНовойЗадачеНаСервере</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/атл_НастройкиПодсистемыУМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>атл_НастройкиПодсистемыУМС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛогинОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьШифрованноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьСинхронизацииССервером</Name>
					<Comment>Периодичность синхронизации с сервером в секундах (минимум 10 секунд)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательДляВыполненияОбменаДанными</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьШифрованиеДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщийКлючШифрования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.атл_КлючиШифрования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьФоновыйРежимОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресКартыДляОтображенияТочек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВходящиеУдачноРазобранныеПакетыОтМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВходящиеУдачноРазобранныеПакетыОтСервера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВЛогахИнформационныеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьВЛогахИнформационныеСообщенияОПакетахОтСервера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьСтатистикуОбменов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяПроверкаДанныхОВыполненныхРаботахВЗадачеМобильномуСотруднику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонЗаполненияЗадачМобильнымСотрудникам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.атл_ШаблоныЗаполненияЗадачМобильнымСотрудникам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособУказанияДатыНазначенияПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.атл_СпособУказанияДатыНазначения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиротаАдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолготаАдресОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресКартыДляОтображенияТочекВебКлиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапускHTTPСервисаРаботаСКартойЛогин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапускHTTPСервисаРаботаСКартойПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/атл_ОбменДаннымиУМС/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодчиститьКукиВРегистре();
	
	мЗаписьРегистраатл_НастройкиПодсистемыУМС = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	мЗаписьРегистраатл_НастройкиПодсистемыУМС.Прочитать(); 
	
	ПериодичностьСинхронизацииССервером = мЗаписьРегистраатл_НастройкиПодсистемыУМС.ПериодичностьСинхронизацииССервером;	
	
	Если мЗаписьРегистраатл_НастройкиПодсистемыУМС.ИспользоватьФоновыйРежимОбмена Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Используется обмен с помощью регламентного задания на сервере. Запуск обработки не требуется!
		|Если база запущена в файловом режиме или запуск регламентного задания на сервере не используется, 
		|то перед запуском обработки в настройках подсистемы УМС снимите флаг 'Использовать фоновый режим обмена'.
		|Вызвать настройки можно из обработки 'Обмен данными УМС'.";
		Сообщение.Сообщить();		
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
	Если ПериодичностьСинхронизацииССервером < 15 Тогда
		ПодключитьОбработчикОжидания("ЗапуститьРегламентноеЗадание", 15);
	Иначе
		ПодключитьОбработчикОжидания("ЗапуститьРегламентноеЗадание", ПериодичностьСинхронизацииССервером);
	КонецЕсли;
	
	ЗапуститьРегламентноеЗадание();	

КонецПроцедуры

&НаСервере
Процедура ПодчиститьКукиВРегистре() Экспорт
	
	ЗаписьРегистраСинхронизацииССервером = РегистрыСведений.атл_ПеременныеСинхронизацииССерверомУМС.СоздатьМенеджерЗаписи();
	ЗаписьРегистраСинхронизацииССервером.Прочитать();
	ЗаписьРегистраСинхронизацииССервером.КукиФоновогоОбмена = "";
	ЗаписьРегистраСинхронизацииССервером.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("ЗапуститьРегламентноеЗадание");
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Вы закрыли обработку обмена! Обмен с сервером остановлен!";
	Сообщение.Сообщить();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРегламентноеЗадание()
	
	мНадписьТекущееСостояниеОбмена = "";
	ВыполнитьОбменУМСПоРасписаниюИзФормы(мНадписьТекущееСостояниеОбмена);
	Элементы.НадписьТекущееСостояниеОбмена.Заголовок = мНадписьТекущееСостояниеОбмена;
	
	Если Не Объект.ОтключитьИнформированиеОСтатусеОбмена Тогда
		мСтр = СокрЛП(СтрЗаменить(мНадписьТекущееСостояниеОбмена, "Выполнен обмен", ""));
		#Если ВебКлиент Тогда
			мСтр = Сред(мСтр,14,19) + " - " + Сред(мСтр,56,8); 	
			ПоказатьОповещениеПользователя("Выполнен обмен",,мСтр);
		#Иначе
			ПоказатьОповещениеПользователя("Выполнен обмен",,мСтр);
		#КонецЕсли
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменУМСПоРасписаниюИзФормы(мНадписьТекущееСостояниеОбмена)
		
	атл_УправлениеМобильнымиСотрудниками.ВыполнитьОбменУМСПоРасписаниюИзФормы(мНадписьТекущееСостояниеОбмена);//ЭлементыФормы.НадписьТекущееСостояниеОбмена);
	
КонецПроцедуры
